// ConsoleApplication1.cpp: определяет точку входа для консольного приложения.
//

#include "stdafx.h"
#include "stdio.h"
#include "conio.h"
#include "math.h"
#include <locale.h>
//библиотеки позволившие поменять цвет текста:
#include <iostream> 
#include <cstdlib>

using namespace std;
/*программа берет каждое число массива и по очереди сравнивает с каждым числом этого же массива,
счётчик К считает количество совпадений при сравнении. Соответсвенно, если число встречается один раз,
то оно совпадет при сравнении только один раз и К будет равно 1, такое число выведется на экран*/


int main()
{
	setlocale(LC_ALL, "RUSSIAN");                                    //установка русского языка
	system("color a");                                               //применение цвета шрифта
	int n, i, s, d, t, m[5];
	puts("\n Введите 5 чисел в массиве");
	scanf_s("%d%d%d%d%d", &m[0], &m[1], &m[2], &m[3], &m[4]);        //ввод чисел массива
	  //printf("mas %d%d%d%d%d", m[0], m[1], m[2], m[3], m[4]);
	int p = 0;
	for (i = 0; i <= 4; i++)                                         //вывод из массива нового числа
	{
	s = m[i];
	int k = 0;
        for (d = 0; d <= 4; d++)                                     //вывод из массива нового числа для сравнения с каждым числом массива
		{
		t = m[d];
		if (s == t){                                                 //сравнение двух чисел из массива
			k += 1;}                                                 //счётчик совпадений	       
		}
		if (k > p){ p = k;
		printf("%d", m[i]);
		}
	}printf("повторилось чаще всех");
	return 0;
}

